# Câu 5: Cho dữ liệu như sau: 
## 1. df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'], 'food': ['fish', 'beans', 'bread']}, columns= ['name', 'food']) 
## 2. df7 = pd.DataFrame({'name': ['Mary', 'Joseph'], 'drink': ['wine', 'beer']}, columns=['name', 'drink']) 
## - Kết hợp 2 bộ dữ liệu này với tham số how='inner', how='outer', how='left', how='right'. 
## Quan sát kết quả trong từng trường hợp.

In [4]:
import numpy as np
import pandas as pd

In [6]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'], 'food': ['fish', 'beans', 'bread']}, columns= ['name', 'food'])
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [8]:
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'], 'drink': ['wine', 'beer']}, columns=['name', 'drink'])
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [10]:
df_6_7_inner = pd.merge(df6, df7, on='name', how='inner')
df_6_7_inner
#how="inner" use only intersection of keys from both table

   name   food drink
0  Mary  bread  wine

In [12]:
df_6_7_outer = pd.merge(df6, df7, on='name', how='outer')
df_6_7_outer
#how="outer" use union of keys of both tables

     name   food drink
0  Joseph    NaN  beer
1    Mary  bread  wine
2    Paul  beans   NaN
3   Peter   fish   NaN

In [14]:
df_6_7_left = pd.merge(df6, df7, on='name', how='left')
df_6_7_left
#how="left" preserve the keys of left table

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [16]:
df_6_7_right = pd.merge(df6, df7, on='name', how='right')
df_6_7_right
#how="right" preserve the keys of right table

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

# Câu 6: Cho dữ liệu như sau: 
## 1. df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 'rank': [1, 2, 3, 4]}) 
## 2. df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 'rank': [3, 1, 4, 2]}) 
## - Kết hợp 2 bộ dữ liệu này với tham số on='tên_cột_trùng_lắp' và/hoặc suffixes=["_L", "_R"]

In [19]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 'rank': [1, 2, 3, 4]}) 
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [21]:
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 'rank': [3, 1, 4, 2]})
df9

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [23]:
df_8_9_L = pd.merge(df8, df9, on='name', suffixes=['_L','_R'])
#The column 'ramk' of two tables are overlapped
#So suffixes=['_L','_R'] will split this "rank" col (joint key) into two separates columns whose name are rank_L and rank_R respectively

df_8_9_L

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2